<a href="https://colab.research.google.com/github/AhmedOmarEissa/AnalyticsInterviews/blob/master/Bucket_Test_Scores.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

This is the answer to the following interview question : [bucket test scores](https://app.interviewquery.com/questions/bucket-test-scores)

In [81]:
import pandas as pd #mainly using pandas

Step 1: Create dummy data and put it in dataframe

In [82]:
data = {'user_id':  [1,2,3,4,5],
        'grade': [10,10,11,10,11],
        'test score': [85,60,90,30,99]
        }

df = pd.DataFrame(data,columns = ['user_id' ,  'grade' , 'test score'] )
df

   user_id  grade  test score
0        1     10          85
1        2     10          60
2        3     11          90
3        4     10          30
4        5     11          99

Step 2: Create the test score buckets and assign labels to each bucket

In [83]:
bins = [0, 50, 75, 90, 100]
labels=['<50','<75','<90' , '<100']
df['test score'] = pd.cut(df['test score'], bins,labels=labels)
df

   user_id  grade test score
0        1     10        <90
1        2     10        <75
2        3     11        <90
3        4     10        <50
4        5     11       <100

Step 3: (first, count # of users in each buckt, then get the percentage of total of scores for each bucket, finally get the cumlative sum of the percentage)

In [85]:
 df = (df
 .groupby(['grade','test score']).agg({'user_id':'count'})
 .fillna(0)
 .groupby(['grade']).apply(lambda x:100 * x / float(x.sum()))
 .groupby(['grade']).cumsum()
 .reset_index())

df

   grade test score  user_id
0     10        <50     25.0
1     10        <75     50.0
2     10        <90     75.0
3     10       <100    100.0
4     11        <50     25.0
5     11        <75     50.0
6     11        <90     75.0
7     11       <100    100.0

Step 4: Formatting the percentage column to the needed format

In [86]:
df['precentage'] = df.user_id.astype(int).astype(str) + '%'
df.drop(columns='user_id',inplace=True)
df

   grade test score precentage
0     10        <50        25%
1     10        <75        50%
2     10        <90        75%
3     10       <100       100%
4     11        <50        25%
5     11        <75        50%
6     11        <90        75%
7     11       <100       100%